package Nachalo;

//Напишите класс, который присваивает двум переменным значения,
// а затем выводит на экран: в первой строке значения обеих переменных
//(с поясняющими надписями), во второй-произведение этих пере­менных
// (с поясняющей надписью), в третьей -сумму этих перемен­ных (с поясняющей надписью).
public class Nachalo5 {
    public static void main(String[] args) {
        int a = 10;
        int b = 5;
        System.out.println("Значение переменной а равно: " + a);
        System.out.println("Значение переменной b равно: " + b);
        System.out.println("Произведение  переменной b и а равно: " + (a-b));
        System.out.println("Сумма переменной b и а равно: " + (b+a));
    }
}
