package For;
//Напишите программу, определяющую сумму всех нечетных чисел от 1 до 99
public class For16 {
    public static void main(String[] args) {
        for (int i = 1; i <=99 ; i+=2) {
            System.out.print(i+" ");
        }
    }
}
