package For;
//Даны описания заголовков циклов. Напишите эти заголовки на языке Java.
//
//1.Цикл выполняется 17 раз, начальное значение переменной-счетчика равно 12.
//2.Цикл выполняется 7 раз, конечное значение переменной-счетчика равно 45.
//3.Цикл выполняется 300 раз, начальное значение переменной-счетчика равно 1, ее значение должно увеличиваться каждый раз на 5.
//4.Цикл выполняется 20 раз, начальное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 10.
//5.Цикл выполняется 300 раз, конечное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 1.
//6.Цикл выполняется 25 раз, конечное значение переменной-счетчика равно 1, ее значение должно уменьшаться каждый раз на 7.
public class For4 {

}
