package For;
//Необходимо написать программу, которая бы вывела в консоль звездочки, как на картинке ниже:
//
//* * * * *
//* * * * *
//* * * * *
public class For7 {
    public static void main(String[] args) {
        for (int i = 0; i < 3; i++) {
            System.out.println("* "+"* "+"* "+"* "+"*");
        }
    }
}
