package Massiv;

//Создать массив типа double с размером 4.
//Записать в него любые значения с помощью блока для инициализации.
//Вывести на консоль значение первого элемента.
public class Massiv2 {
    public static void main(String[] args) {
        double[] chislo = {12.3,23.4,21.3,12.23};
        System.out.println(chislo[3]);
    }
}
